meeting/minutes/2023/02-14.org
:PROPERTIES:
:ID:       CF62C58C-411A-499C-A749-C1890D3D53C3
:END:
#+title: QT4 CG Meeting 022 Minutes 2023-02-14
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Draft Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

* Summary of new and continuing actions [0/11]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-021-01: NW to raise a PR addressing the points in issue #307
+ [ ] QT4CG-021-02: NW to check for deprecated URI features and add options for them in =fn:build-uri= and =fn:parse-uri=
+ [ ] QT4CG-021-03: RD to change =must= to =will= in DOM notes about lowercase
+ [ ] QT4CG-021-04: RD to revise and move the note about unrecognized entities
+ [ ] QT4CG-022-01: NW to investigate the illegible, dark blue background color in serialization
+ [ ] QT4CG-022-02: MK to add meta element selection to the list of implementation-defined things in serialization
+ [ ] QT4CG-022-03: MK to add a note about why multiple for and let clauses were added to XPath
+ [ ] QT4CG-022-04: MK to update the collation parameter on fn:deep-equal to accept an empty sequence.
+ [ ] QT4CG-022-05: MK to make sure that the option list in fn:deep-equal is sorted lexicographically

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [10/14]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: BTW

+ [ ] Anthony (Tony) Bufort (AB)
+ [X] Reece Dunn (RD)
+ [X] Sasha Firsov (SF)
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK) [:08-]
+ [X] Michael Kay (MK)
+ [X] John Lumley (JL)
+ [X] Dimitre Novatchev (DN)
+ [X] Ed Porter (EP)
+ [ ] Liam Quin (LQ)
+ [ ] Adam Retter
+ [X] C. M. Sperberg-McQueen (MSM) [:06-]
+ [ ] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW). /Scribe/. /Chair/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2023/02-14.html][the agenda]].

Accepted.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2023/02-07.html][the minutes of the previous meeting]].

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting [[../../agenda/2023/02-21.html][is scheduled for Tuesday, 21 February 2023]].

Focus next week is XSLT; MK to help with the agenda.

Regrets: CG.

** Review of open action items [0/6]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-021-01: NW to raise a PR addressing the points in issue #307
+ [ ] QT4CG-021-02: NW to check for deprecated URI features and add options for them in =fn:build-uri= and =fn:parse-uri=
+ [ ] QT4CG-021-03: RD to change =must= to =will= in DOM notes about lowercase
+ [ ] QT4CG-021-04: RD to revise and move the note about unrecognized entities

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

