meeting/minutes/2023/02-14.org
** PR #342: Meta elements
:PROPERTIES:
:CUSTOM_ID: pr-342
:END:

See [[https://qt4cg.org/dashboard/#pr-342][pull request #342]].

+ MK: This is a bug from a Saxon user. The XHTML and HTML methods add
  meta elements with a content type. HTML5 has introduced a new meta
  element that doesn’t have a content type, it just says charset=. If
  we leave that one in the document, then you get an HTML validation
  error.
  + … Compliance with the serialization spec leads to invalid HTML.
  + … We fixed that in Saxon but now we’re not compliant with the
    serialization spec!
  + … This PR proposes to update the serialization spec.

The changes are all in the serialization spec.

+ MK: I did some housekeeping; I dropped all the diff markup from
  before 3.1. Fixed a few whitespace issues.
+ MK summarizes changes to section 4.
  + Some discussion of the change from “along with discarding” to
    “possibly replacing”

ACTION QT4CG-022-01: NW to investigate the illegible, dark blue background color in serialization

+ MK discusses the changes in the beginning of 6.1.14.
+ MK: Basically, this just licenses the new syntax if that’s what you
  choose to do.
+ MK: It says pretty much the same thing for the HTML output method in
  7.4.13.

+ DN: Seems ok, but I’m a little bit concerned about using “might” and
  “may”. That means it depends on the implementation.
+ MK: Yes, that’s a good point. I decided not to require that
  implementations use the new behavior. Some implementations might
  want to keep the old syntax.

Some discussion about the fact that it’s an implementation-defined result.

+ NW: Perhaps making this a “should” requirement would help?

Some discussion of the fact that this only applies to the HTML5 output
method.

+ MK: Should we even continue supporting versions of HTML before 5 anyway?
+ MSM: For what it’s worth, as a late adopter, I would be very unhappy
  if we got rid of HTML4 because that’s typically what I use.
  + … I do kind of like the idea that if we’re going to offer this as
    a choice we should add it to the list of things that are
    implementation-defined.

ACTION QT4CG-022-02: MK to add meta element selection to the list of implementation-defined things in serialization

+ SF: Depending on the situation, I’d be rendering in XHTML or HTML5.
  That means I’d have to change how the meta tag differently in
  different cases.
+ MK: They’re different output methods, but they share a lot in
  common. The way the spec is structured, they have to be described
  twice, but both methods take the same option.
  + … I don’t really understand how XHTML evolves as HTML5 changes.
+ RD: Effectively, XHTML is an XML serialization of the
  HTML5 DOM.
+ NW: That’s what I thought.

+ DN: I’m happy we discussed this. We must be aware that I find this
  is a problem as a developer. I think if there are implementation
  defined things, maybe we should provide an appendix that shows the
  choices implementations made.

Some discussion of the appropriateness of adding this to the
specification. The Schema WG did not find the process of trying to
maintain this kind of thing easy or satisfactory.

DN remains concerned that there should be some place where the
implementation defined features for all the implementations can be
recorded.

+ MK: Are you volunteering?
+ DN: I don’t have much experience, but maybe.

Proposal: Accept this PR

Accepted.

