meeting/minutes/2023/02-14.html

<div id="outline-container-pr-342" class="outline-3">
<h3 id="pr-342"><span class="section-number-3">2.1.</span> PR #342: Meta elements</h3>
<div class="outline-text-3" id="text-pr-342">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-342">pull request #342</a>.
</p>

<ul class="org-ul">
<li>MK: This is a bug from a Saxon user. The XHTML and HTML methods add
meta elements with a content type. HTML5 has introduced a new meta
element that doesn’t have a content type, it just says charset=. If
we leave that one in the document, then you get an HTML validation
error.
<ul class="org-ul">
<li>… Compliance with the serialization spec leads to invalid HTML.</li>
<li>… We fixed that in Saxon but now we’re not compliant with the
serialization spec!</li>
<li>… This PR proposes to update the serialization spec.</li>
</ul></li>
</ul>

<p>
The changes are all in the serialization spec.
</p>

<ul class="org-ul">
<li>MK: I did some housekeeping; I dropped all the diff markup from
before 3.1. Fixed a few whitespace issues.</li>
<li>MK summarizes changes to section 4.
<ul class="org-ul">
<li>Some discussion of the change from “along with discarding” to
“possibly replacing”</li>
</ul></li>
</ul>

<p>
ACTION QT4CG-022-01: NW to investigate the illegible, dark blue background color in serialization
</p>

<ul class="org-ul">
<li>MK discusses the changes in the beginning of 6.1.14.</li>
<li>MK: Basically, this just licenses the new syntax if that’s what you
choose to do.</li>
<li>MK: It says pretty much the same thing for the HTML output method in
7.4.13.</li>

<li>DN: Seems ok, but I’m a little bit concerned about using “might” and
“may”. That means it depends on the implementation.</li>
<li>MK: Yes, that’s a good point. I decided not to require that
implementations use the new behavior. Some implementations might
want to keep the old syntax.</li>
</ul>

<p>
Some discussion about the fact that it’s an implementation-defined result.
</p>

<ul class="org-ul">
<li>NW: Perhaps making this a “should” requirement would help?</li>
</ul>

<p>
Some discussion of the fact that this only applies to the HTML5 output
method.
</p>

<ul class="org-ul">
<li>MK: Should we even continue supporting versions of HTML before 5 anyway?</li>
<li>MSM: For what it’s worth, as a late adopter, I would be very unhappy
if we got rid of HTML4 because that’s typically what I use.
<ul class="org-ul">
<li>… I do kind of like the idea that if we’re going to offer this as
a choice we should add it to the list of things that are
implementation-defined.</li>
</ul></li>
</ul>

<p>
ACTION QT4CG-022-02: MK to add meta element selection to the list of implementation-defined things in serialization
</p>

<ul class="org-ul">
<li>SF: Depending on the situation, I’d be rendering in XHTML or HTML5.
That means I’d have to change how the meta tag differently in
different cases.</li>
<li>MK: They’re different output methods, but they share a lot in
common. The way the spec is structured, they have to be described
twice, but both methods take the same option.
<ul class="org-ul">
<li>… I don’t really understand how XHTML evolves as HTML5 changes.</li>
</ul></li>
<li>RD: Effectively, XHTML is an XML serialization of the
HTML5 DOM.</li>
<li>NW: That’s what I thought.</li>

<li>DN: I’m happy we discussed this. We must be aware that I find this
is a problem as a developer. I think if there are implementation
defined things, maybe we should provide an appendix that shows the
choices implementations made.</li>
</ul>

<p>
Some discussion of the appropriateness of adding this to the
specification. The Schema WG did not find the process of trying to
maintain this kind of thing easy or satisfactory.
</p>

<p>
DN remains concerned that there should be some place where the
implementation defined features for all the implementations can be
recorded.
</p>

<ul class="org-ul">
<li>MK: Are you volunteering?</li>
<li>DN: I don’t have much experience, but maybe.</li>
</ul>

<p>
Proposal: Accept this PR
</p>

<p>
Accepted.
</p>
</div>
</div>
