meeting/minutes/2023/02-14.org
** PR #344: Issue 22, allow for/let to be repeated
:PROPERTIES:
:CUSTOM_ID: pr-344
:END:

See [[https://qt4cg.org/dashboard/#pr-344][pull request #344]].

+ MK: I think this was originally raised by RD. The only question here
  is how far to go. I chose not to go very far. I changed things so
  that let and for can be repeated but not mixed.

MK shares the XPath spec for review.

+ MK: SimpleForClause allows the keyword “for” as an alternative to
  “,” which makes it look more like an XQuery FLOWR expression with
  multiple “for”s
  + … The spec describes how the “for”s are syntactic sugar.
+ MK: We do the same thing for let expressions in SimpleLetClause.
  + … This doesn’t preclude going further, but it’s a starting point.
+ DN: Who needs this? We have the “,” why do we need repeated “for” or
  “let”?
+ RD: It’s a preference thing; if you’re copying code from XQuery
  where you’ve used multiple fors or lets, or if you have an XQuery
  background, it will be what’s familiar.
  + … Kind of like how many languages support multiple variable
    declarations by commas or repeated specifications.
    =(int x; int y; int j; vs. int x,y,j;)=
+ DN: Then maybe the prose should explain that.
+ MSM: I’m kind of torn; MK has probably hit something of a sweet spot
  here, precisely because for/let and the “,” are synonymous. Because
  XPath is not quite the same as XQuery makes me have to think harder.
  And the fact that XPath is more restrictive, that helps me keep
  track of the boundary. Anything that makes it look more like XQuery
  makes me worry that I’ll have a harder time maintaining the
  distinction.
  + … As to the concern, why would anyone want to do this, I use
    repeated “for” instead of “,” as a rhetorical device. It lets me
    make it clear to six-months-from-now-me, that these are the
    variables I’m going to be changing and not these other variables.
    Using “for” to signal a fresh start is useful to me.
+ JL: Something that’s bugging me: the “,” embedded after the let
  stands for “return let”. When “let” is embedded, it also means
  “return let”. But you could write “return let”, so you’ve got a
  weirdly redundant token!
+ MK: It’s just saying you can leave out the return.
+ RD: This is saying that these are defined in terms of single lets
  and single fors because XPath originally only had one. So you had to
  define the comma version as an expansion. Or was it something like
  that?
+ MK: It allowed the “,” from the beginning. The reason that it was a
  macro was to avoid adding tuple streams of bindings to the
  semantics.
+ DN: I hear what MSM is saying, that he doesn’t want XQuery to be
  mechanically put into XPath. I wouldn’t object to having in XPath an
  XQuery feature that gives us new functionality, but this doesn’t
  provide any new functionality.
+ MK: From my perspective, I find laying things out with “,”s much
  more difficult. I’ve tended to standardize on putting the comma at
  the beginning of the line which is ugly. Putting it at the end makes
  it seems like part of the expression. The comma can disappear at the
  end of the line, but the “let” stands out more.
+ DN: Then we should make sure that the spec says this is for
  readability or the other reasons so that it’s cleary.
+ JL: The note at the end of 4.13 is an example of code that’s easier
  to read with multple “let”s.
+ DN: I wouldn’t find it any harder to read if the second and
  following “let”s were replaced with commas.
+ RD: We don’t have similar justification for any of the other parts of the spec.
+ MK: There are lots of places where we do and lots of places where we
  don’t.
+ EP: Wouldn’t it be just as good to put that in the changes appendix?
+ MSM: I think the list of changes is the right place to say that this
  change is syntactic sugar. I sometimes react allergically when
  changes are described as for usability when I find them less usable.

ACTION QT4CG-022-03: MK to add a note about why multiple for and let clauses were added to XPath

Proposal: Accept this PR

Accepted.

(MK will provide the note and then we’ll merge the PR.)

