meeting/minutes/2023/02-14.org
** PR #320: Issue 98 - add options parameter to fn:deep-equal
:PROPERTIES:
:CUSTOM_ID: h-8455483D-D0AF-499A-A74A-552B33A9F395
:END:

See [[https://qt4cg.org/dashboard/#pr-320][pull request #320]]. When [[https://qt4cg.org/meeting/minutes/2023/02-07.html#h-8455483D-D0AF-499A-A74A-552B33A9F395][last we met]], Mike was working on test
cases and an implementation. More detail is expected.

+ MK: I have committed further changes. Let’s take a look.
+ MK: Where are we…
+ MK: The collation parameter should allow empty sequence.

ACTION QT4CG-022-04: MK to update the collation parameter on fn:deep-equal to accept an empty sequence.

+ MK: I’ve renamed and clarified a few options.
  + … Added ‘base-uri’ to compare base URIs.
  + … There was a comment about consistency of ‘idref’ vs. ‘idrefs’
  + … I renamed one of the parameters to ‘normalized-space’ for consistency.

ACTION QT4CG-022-05: MK to make sure that the option list in fn:deep-equal is sorted lexicographically

+ MK: XSLT users are familiar with ‘preserve-space’ so I went with
  that name.
  + … I expanded how equal-strings is described to include a code implementation.
  + … The rest is fairly mechanical…
  + … Added a note describing how the different whitespace handling
    options relate to each other.
  + … I decided not to consider xml:space attributes.

+ MSM: If you say xml:space=preserve and two documents have different
  indentation, I will be preserved if they compare the same.
+ MK: Basically, whitespace is significant unless you say it isn’t and
  there are a variety of ways to do that.
  + … There’s a note about what it means if you specify both
    preserve-space and normalize-space. Basically 1 space equals 2
    spaces, but no zero spaces.
+ MK: The only real error condition is trying to compare functions.
  You can get errors if you specify invalid options. I decided that
  ‘false-on-error’ doesn’t stop invalid options from being an error.
+ MK: And I added more examples. And there are many more in the test suite.
+ DN: I think this is very well done, but I would be more happy if the
  default for the option ‘false-if-error’ was true. We need a
  comparison function in many other places where we don’t want errors.
  If we can’t change it here, I want another function with exactly the
  same semantics but with false-if-error set to true.
+ MK: But that means that some sequences aren’t equal to themselves,
  which bugs me.
+ DN: This inequality-to-self happens only if there are special,
  abnormal values in the sequences such as NaN, plus or minus Infinity.
+ RD: You can’t really disregard things like NaN and infinities when
  comparing values because in the IEEE specification, there’s more
  than one NaN. That’s one of the reasons why comparing two NaN values
  returns false. 
+ DN: It is a lie that 'INF' is equal to 'INF'. We all know that the
  infinity of all irrational numbers is greater than the infinity of all
  rational numbers. When the Domain of the comparison function has these
  abnormal values removed, then we truly have the property of reflexivity,
  and thus the comparison is an equivalence relation.
+ MK: In deep-equal it returns true.
+ DN: We should fix that too.
+ MK: We’d need a new option if we wanted to change that.
+ RD: When comparing things like NaNs and infinities, what you
  typically do is rely on the IEEE spec and things like the C
  comparison functions that have specific behavior. We may not like
  that behavior, but it is what it is.
+ DN: I’m proposing a new function deep-comparison that doesn’t have
  backwards compatibility issues and can have any semantics we want.

We’ve run out of time. We’ll come back to this issue in two weeks;
next week is an XSLT-focused meeting.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
